# Задача 1. Случайная непрерывная величина A имеет равномерное распределение 
# на промежутке (200, 800]. Найдите ее среднее значение и дисперсию.

a = 200
b = 800

print(f"Среднее значение = {(a+b)/2}")
print(f"Дисперсия = {(a-b)**2/12}")

