# Задача 3. Непрерывная случайная величина X распределена нормально 
# и задана плотностью распределения f(x) = (1 / (4 * sqrt(2pi))) * exp((-(x+2)**2) / 32).
# Найдите:
# а). M(X)
# б). D(X)
# в). std(X) (среднее квадратичное отклонение)

print(f"Среднее значение M(X) = {-2}")
print(f"Дисперсия D(X) = {16}")
print(f"Cреднее квадратичное отклонение std(X) = {4}")

